app/views/blog_posts/show.html.erb

</div><br>
<h2 style="text-align: center; text-decoration: underline;">Total Comments: <%= @blog_post.comments.count %></h2>
---
SELECT "comments".* FROM "comments" WHERE "comments"."blog_post_id" = ?  [["blog_post_id", 1]]
SELECT COUNT(*) FROM `comments` WHERE `comments`.`blog_post_id` = 1