app/controllers/blog_posts_controller.rb

SELECT `blog_posts`.* FROM `blog_posts`
---
  def index
  	@blog_posts = BlogPost.all

INSERT INTO "blog_posts" ("title", "author", "blog_entry", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", ";lkjl;kj"], ["author", ";lkjl;kj"], ["blog_entry", ";lkj;lkj;lkj;lkj;lkj;lkj;lkj;ljk"], ["created_at", "2017-11-24 03:14:21.789115"], ["updated_at", "2017-11-24 03:14:21.789115"]]
---
  def create
  	@blog_post = BlogPost.new(blog_post_params)
  	respond_to do |format|
  		if @blog_post.save

UPDATE `blog_posts` SET `blog_entry` = 'Hello, my name is Brian Ruff, and this is a test post. I hope it works!! It does work!!', `updated_at` = '2017-11-24 04:06:23' WHERE `blog_posts`.`id` = 1
---
  def update
  	respond_to do |format|
  		if @blog_post.update(blog_post_params)

DELETE FROM "blog_posts" WHERE "blog_posts"."id" = ?  [["id", 2]]
---
  def destroy
  	@blog_post.destroy

SELECT  "blog_posts".* FROM "blog_posts" WHERE "blog_posts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def set_blog_post
  	@blog_post = BlogPost.find(params[:id])