app/controllers/comments_controller.rb

  def create
    @blog_post = BlogPost.find(params[:blog_post_id])
    @comment = @blog_post.comments.create(set_comment)
---
SELECT  `blog_posts`.* FROM `blog_posts` WHERE `blog_posts`.`id` = NULL LIMIT 1
INSERT INTO `comments` (`author`, `comment_entry`, `created_at`, `updated_at`, `blog_post_id`) VALUES ('Brian Ruff', 'this is a comment', '2017-11-24 05:25:01', '2017-11-24 05:25:01', 1)

  def destroy
    @blog_post = BlogPost.find(params[:blog_post_id])
    @comment = @blog_post.comments.find(params[:id])
    @comment.destroy
---
SELECT  `blog_posts`.* FROM `blog_posts` WHERE `blog_posts`.`id` = 1 LIMIT 1
SELECT  `comments`.* FROM `comments` WHERE `comments`.`blog_post_id` = 1 AND `comments`.`id` = 2 LIMIT 1
DELETE FROM `comments` WHERE `comments`.`id` = 2